###################################################################

# Created by write_sdc on Mon Jun 21 02:55:31 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_load -pin_load 0.06 [get_ports {Idata[25]}]
set_load -pin_load 0.06 [get_ports {Idata[24]}]
set_load -pin_load 0.06 [get_ports {Idata[23]}]
set_load -pin_load 0.06 [get_ports {Idata[22]}]
set_load -pin_load 0.06 [get_ports {Idata[21]}]
set_load -pin_load 0.06 [get_ports {Idata[20]}]
set_load -pin_load 0.06 [get_ports {Idata[19]}]
set_load -pin_load 0.06 [get_ports {Idata[18]}]
set_load -pin_load 0.06 [get_ports {Idata[17]}]
set_load -pin_load 0.06 [get_ports {Idata[16]}]
set_load -pin_load 0.06 [get_ports {Idata[15]}]
set_load -pin_load 0.06 [get_ports {Idata[14]}]
set_load -pin_load 0.06 [get_ports {Idata[13]}]
set_load -pin_load 0.06 [get_ports {Idata[12]}]
set_load -pin_load 0.06 [get_ports {Idata[11]}]
set_load -pin_load 0.06 [get_ports {Idata[10]}]
set_load -pin_load 0.06 [get_ports {Idata[9]}]
set_load -pin_load 0.06 [get_ports {Idata[8]}]
set_load -pin_load 0.06 [get_ports {Idata[7]}]
set_load -pin_load 0.06 [get_ports {Idata[6]}]
set_load -pin_load 0.06 [get_ports {Idata[5]}]
set_load -pin_load 0.06 [get_ports {Idata[4]}]
set_load -pin_load 0.06 [get_ports {Idata[3]}]
set_load -pin_load 0.06 [get_ports {Idata[2]}]
set_load -pin_load 0.06 [get_ports {Idata[1]}]
set_load -pin_load 0.06 [get_ports {Idata[0]}]
set_load -pin_load 0.06 [get_ports {wdata[25]}]
set_load -pin_load 0.06 [get_ports {wdata[24]}]
set_load -pin_load 0.06 [get_ports {wdata[23]}]
set_load -pin_load 0.06 [get_ports {wdata[22]}]
set_load -pin_load 0.06 [get_ports {wdata[21]}]
set_load -pin_load 0.06 [get_ports {wdata[20]}]
set_load -pin_load 0.06 [get_ports {wdata[19]}]
set_load -pin_load 0.06 [get_ports {wdata[18]}]
set_load -pin_load 0.06 [get_ports {wdata[17]}]
set_load -pin_load 0.06 [get_ports {wdata[16]}]
set_load -pin_load 0.06 [get_ports {wdata[15]}]
set_load -pin_load 0.06 [get_ports {wdata[14]}]
set_load -pin_load 0.06 [get_ports {wdata[13]}]
set_load -pin_load 0.06 [get_ports {wdata[12]}]
set_load -pin_load 0.06 [get_ports {wdata[11]}]
set_load -pin_load 0.06 [get_ports {wdata[10]}]
set_load -pin_load 0.06 [get_ports {wdata[9]}]
set_load -pin_load 0.06 [get_ports {wdata[8]}]
set_load -pin_load 0.06 [get_ports {wdata[7]}]
set_load -pin_load 0.06 [get_ports {wdata[6]}]
set_load -pin_load 0.06 [get_ports {wdata[5]}]
set_load -pin_load 0.06 [get_ports {wdata[4]}]
set_load -pin_load 0.06 [get_ports {wdata[3]}]
set_load -pin_load 0.06 [get_ports {wdata[2]}]
set_load -pin_load 0.06 [get_ports {wdata[1]}]
set_load -pin_load 0.06 [get_ports {wdata[0]}]
set_load -pin_load 0.06 [get_ports {ofmap[24]}]
set_load -pin_load 0.06 [get_ports {ofmap[23]}]
set_load -pin_load 0.06 [get_ports {ofmap[22]}]
set_load -pin_load 0.06 [get_ports {ofmap[21]}]
set_load -pin_load 0.06 [get_ports {ofmap[20]}]
set_load -pin_load 0.06 [get_ports {ofmap[19]}]
set_load -pin_load 0.06 [get_ports {ofmap[18]}]
set_load -pin_load 0.06 [get_ports {ofmap[17]}]
set_load -pin_load 0.06 [get_ports {ofmap[16]}]
set_load -pin_load 0.06 [get_ports {ofmap[15]}]
set_load -pin_load 0.06 [get_ports {ofmap[14]}]
set_load -pin_load 0.06 [get_ports {ofmap[13]}]
set_load -pin_load 0.06 [get_ports {ofmap[12]}]
set_load -pin_load 0.06 [get_ports {ofmap[11]}]
set_load -pin_load 0.06 [get_ports {ofmap[10]}]
set_load -pin_load 0.06 [get_ports {ofmap[9]}]
set_load -pin_load 0.06 [get_ports {ofmap[8]}]
set_load -pin_load 0.06 [get_ports {ofmap[7]}]
set_load -pin_load 0.06 [get_ports {ofmap[6]}]
set_load -pin_load 0.06 [get_ports {ofmap[5]}]
set_load -pin_load 0.06 [get_ports {ofmap[4]}]
set_load -pin_load 0.06 [get_ports {ofmap[3]}]
set_load -pin_load 0.06 [get_ports {ofmap[2]}]
set_load -pin_load 0.06 [get_ports {ofmap[1]}]
set_load -pin_load 0.06 [get_ports {ofmap[0]}]
set_load -pin_load 0.06 [get_ports ctrl_]
set_load -pin_load 0.06 [get_ports read_I]
set_load -pin_load 0.06 [get_ports read_w]
set_load -pin_load 0.06 [get_ports write_o]
set_load -pin_load 0.06 [get_ports end_conv]
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_clock_latency -max 0.6  [get_clocks clk]
set_clock_latency -source -max 1  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  -max 0.6  [get_ports clk]
set_input_delay -clock clk  -max 0.6  [get_ports start_conv]
set_input_delay -clock clk  -max 0.6  [get_ports {cfg_ci[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {cfg_ci[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {cfg_co[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {cfg_co[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in0_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in0_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in0_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in0_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in0_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in0_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in0_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in0_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in1_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in1_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in1_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in1_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in1_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in1_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in1_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in1_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in2_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in2_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in2_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in2_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in2_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in2_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in2_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in2_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in3_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in3_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in3_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in3_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in3_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in3_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in3_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in3_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in4_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in4_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in4_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in4_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in4_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in4_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in4_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in4_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in5_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in5_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in5_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in5_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in5_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in5_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in5_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in5_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in6_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in6_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in6_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in6_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in6_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in6_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in6_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in6_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in7_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in7_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in7_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in7_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in7_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in7_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in7_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {in7_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight0_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight0_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight0_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight0_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight0_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight0_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight0_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight0_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight1_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight1_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight1_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight1_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight1_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight1_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight1_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight1_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight2_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight2_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight2_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight2_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight2_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight2_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight2_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight2_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight3_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight3_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight3_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight3_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight3_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight3_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight3_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight3_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight4_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight4_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight4_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight4_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight4_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight4_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight4_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight4_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight5_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight5_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight5_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight5_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight5_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight5_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight5_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight5_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight6_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight6_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight6_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight6_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight6_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight6_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight6_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight6_[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight7_[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight7_[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight7_[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight7_[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight7_[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight7_[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight7_[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {weight7_[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[25]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[24]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[23]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[22]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[21]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[20]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[19]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[18]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[17]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[16]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[15]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[14]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[13]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[12]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[11]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[10]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[9]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {Idata[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[25]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[24]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[23]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[22]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[21]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[20]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[19]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[18]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[17]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[16]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[15]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[14]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[13]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[12]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[11]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[10]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[9]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {wdata[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[24]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[23]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[22]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[21]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[20]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[19]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[18]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[17]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[16]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[15]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[14]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[13]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[12]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[11]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[10]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[9]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {ofmap[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports ctrl_]
set_output_delay -clock clk  -max 0.6  [get_ports read_I]
set_output_delay -clock clk  -max 0.6  [get_ports read_w]
set_output_delay -clock clk  -max 0.6  [get_ports write_o]
set_output_delay -clock clk  -max 0.6  [get_ports end_conv]
